[
  {
    "api_id": 637794,
    "name": "Cherry-Berry Pie With Agave Nectar All-Butter Crust",
    "instructions": "Make the crust:\nPulse the dry ingredients 5-6 times.\nAdd 2 sticks of very cold butter (I freeze mine), cut into cubes. Pulse until the ingredients resemble very coarse meal.\nAdding the agave nectar and fiore di Sicilia flavoring (can substitute orange extract) one tablespoon at a time.\nWatch to see the dough just comes together.\nDivide the dough into two parts, one larger than the other.\nForm each into a flat, round shape.\nWrap each disk in plastic and refrigerate for at least 2 hours.\nWhile the dough is chilling, make the filling.\nIn a large bowl, combine all the filling ingredients.\nMix until well incorporated (it will be very soupy).\nTake the dough out of the fridge.\nLet it warm enough to be able to roll it out.\nRoll out the crust to fit it to your pie dish.\nYou may need to patch some, but none will show to your eaters.\nWrap the pie dish in plastic and chill for 30 minutes.\nPour the filling into the crust.\nAgain, wrap the pie in plastic and chill.\nRoll out the other dough disk.\nUse your favorite cookie cutters to cut pieces for the top crust.\nTake the pie out of the fridge and decorate the top.\nJust remember to leave spots for steam to escape.\nCover the edges with foil and bake at 325 degrees F for 40 minutes.\nRemove foil and bake until golden brown top and the filling is bubbling.\nLet cool and enjoy!",
    "image": "https://webknox.com/recipeImages/637794-556x370.jpg",
    "source_url": "https://spoonacular.com/recipes/Cherry-Berry-Pie-With-Agave-Nectar-All-Butter-Crust-637794",
    "servings": 10,
    "ready_time": 180
  },
  {
    "api_id": 1464301,
    "name": "The Best Homemade Meatloaf",
    "instructions": "Preheat oven to 350 degrees.\nPress the brown sugar into the bottom of the pan.\nMix the meat, eggs, onion, peppers, seasoning, crackers, and milk.\nLightly pack the pan with the meatloaf mixture.\nAdd the ketchup glaze to the meatloaf. Bake uncovered for 1 hour 10 minutes, or until juices run clear.\nAllow the meatloaf to rest for 10 minutes before slicing and serving.",
    "image": "https://www.pinkwhen.com/wp-content/uploads/2020/06/Homemade-Meatloaf.jpg.webp",
    "source_url": "https://www.pinkwhen.com/the-best-homemade-meatloaf/",
    "servings": 6,
    "ready_time": 80
  },
  {
    "api_id": 649340,
    "name": "Layered Baked Eggplant Parmesan",
    "instructions": "Preheat oven to 375 degrees Fahrenheit. Place a sheet of aluminum foil on baking sheet. Spray with olive oil cooking spray. Slice ends off of eggplant and peel skin off with a vegetable peeler. Slice into inch pieces.\nIn a shallow container, add eggs and water. Whisk to combine. In a separate container, add breadcrumbs, Italian seasoning and onion powder. Mix together. Dip eggplant slices into egg mixture. Let excess drip off and then dip into breadcrumbs. Coat evenly with breadcrumbs, pressing them onto the sides.\nPlace on baking sheet. Spray tops lightly with olive oil spray. Place in oven and cook for 20 minutes. Flip over and cook for another 20 minutes, until the tops are golden brown.\nRemove from oven. In a 8 by 8 baking sheet, add a cup of tomato sauce to the bottom spread evenly. Add 4 slices eggplant. Top with cup cheese and cup shredded Parmesan cheese. Add 3 more layers of sauce, eggplant and cheese.\nPlace back in oven and bake till cheese gets slightly browned on top, about 15 minutes. ENJOY!",
    "image": "https://webknox.com/recipeImages/649340-556x370.jpg",
    "source_url": "https://www.foodista.com/recipe/6P26YNZH/layered-baked-eggplant-parmesan",
    "servings": 4,
    "ready_time": 60
  }
]
